Revit 2027 API
PointCloudOverrides.IsEqual Method
 Check if the contents of two overrides are equal.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	PointCloudOverrides other
)
Public Function IsEqual (
	other As PointCloudOverrides
) As Boolean
public:
bool IsEqual(
	PointCloudOverrides^ other
)
member IsEqual :
        other : PointCloudOverrides -> bool
Parameters
other PointCloudOverrides
 The overrides to be compared.
Return Value
Boolean
 True for equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace